Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>Установка цен на номенклатуру</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрировытьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/НеИспользовать_ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Ложь;
	
	Если Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая() И НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
		Объект.НеРегистрировытьНулевыеЦены = Истина;
		ЭтоНовый = Истина;
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	//определим существующий вид цен и отметим тем, что используются в документе
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка,
	|	ВидыЦен.Код,
	|	ВидыЦен.Архивный
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЦен.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ПраваПользователей.ВидЦенДоступенПользователю(Выборка.Ссылка) Тогда
			НоваяСтрока = ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены = Выборка.Ссылка;
			НоваяСтрока.Код = Выборка.Код;
			НоваяСтрока.Архивный = Выборка.Архивный;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Объект.Ссылка.Пустая() ИЛИ НЕ Параметры.ЗначениеКопирования.Пустая() ИЛИ ЗначениеЗаполнено(Параметры.Основание) Тогда
		Для Каждого ТекущаяСтрока Из Объект.ВидыЦен Цикл
			Для Каждого ТекущийВидЦен Из ВидыЦен Цикл
				Если ТекущаяСтрока.ВидЦены = ТекущийВидЦен.ВидЦены Тогда
					ТекущийВидЦен.Устанавливать = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//отсекаем архивные
	ВременнаяТаблица = ВидыЦен.Выгрузить();
	ВидыЦен.Очистить();
	Для Каждого ТекущаяСтрока Из ВременнаяТаблица Цикл
		Если ТекущаяСтрока.Архивный и НЕ ТекущаяСтрока.Устанавливать Тогда
			//пропускаем
		Иначе
			НоваяСтрока = ВидыЦен.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект.ВидыЦен Цикл
		НоваяСтрока = ВремВидЦен.Добавить();
		НоваяСтрока.ВидЦены = ТекущаяСтрока.ВидЦены;
	КонецЦикла;
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого Стр из Объект.Товары Цикл
		Если Стр.Номенклатура <> Номенклатура Тогда
			СтрДерево = Дерево.Строки.Добавить();
			СтрДерево.Номенклатура = Стр.Номенклатура;
			Номенклатура = Стр.Номенклатура;
		КонецЕсли;
		СтрДеревоВид = СтрДерево.Строки.Добавить();
		СтрДеревоВид.Номенклатура = Стр.Номенклатура;
		СтрДеревоВид.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры;
		СтрДеревоВид.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
		СтрДеревоВид.Цена = Стр.Цена;
		СтрДеревоВид.ВидЦены = Стр.ВидЦены;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
	
	Элементы.ЦеныНаФормеЦена.Заголовок = "Цена, " + Объект.Валюта.Наименование;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ПараметрыЗаписи)
	
	Объект.ВидыЦен.Очистить();
	Для Каждого ТекущаяСтрока Из ВидыЦен Цикл
		Если ТекущаяСтрока.Устанавливать Тогда
			НоваяСтрока = Объект.ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены = ТекущаяСтрока.ВидЦены;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Очистить();
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Для Каждого СтрНоменклатура из Строка.Строки Цикл
			Если (НЕ СтрНоменклатура.Номенклатура.Пустая()) И (НЕ СтрНоменклатура.ВидЦены.Пустая()) Тогда
				Стр = Объект.Товары.Добавить();
				Стр.Номенклатура = СтрНоменклатура.Номенклатура;
				Стр.ХарактеристикаНоменклатуры = СтрНоменклатура.ХарактеристикаНоменклатуры;
				Стр.ЕдиницаИзмерения = СтрНоменклатура.ЕдиницаИзмерения;
				Стр.Цена = СтрНоменклатура.Цена;
				Стр.ВидЦены = СтрНоменклатура.ВидЦены;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере(Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Элементы.ЦеныНаФормеЦена.Заголовок = "Цена, " + Объект.Валюта;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВидыЦенПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция КоличествоСтрокВДеревеЦен()
	
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Возврат Дерево.Строки.Количество(); 
	
КонецФункции

&НаСервере
Процедура ДобавитьВидЦенВСтроки(ВидЦен)
	
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		
		ЗапросХарактеристики = Новый Запрос;
		ЗапросХарактеристики.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
		ЗапросХарактеристики.УстановитьПараметр("Владелец", Строка.Номенклатура);
		РезультатЗапросаХарактеристики = ЗапросХарактеристики.Выполнить();
	   	ВыборкаХарактеристики = РезультатЗапросаХарактеристики.Выбрать();
		Если ВыборкаХарактеристики.Количество() = 0 Тогда

			Стр = Строка.Строки.Добавить();
			Стр.Номенклатура = Строка.Номенклатура;
			Стр.ВидЦены = ВидЦен;
			Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
			
			//теперь добавим по всем единицам измерений по данной номенклатуре
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиницыИзмерений.Ссылка
			|ИЗ
			|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
			|ГДЕ
			|	ЕдиницыИзмерений.Владелец = &Владелец
			|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрДеревоВид = Строка.Строки.Добавить();
				СтрДеревоВид.Номенклатура = Стр.Номенклатура;
				СтрДеревоВид.ЕдиницаИзмерения = Выборка.Ссылка;
				СтрДеревоВид.ВидЦены = ВидЦен;
			КонецЦикла;
		Иначе
			
			Пока ВыборкаХарактеристики.Следующий() Цикл
				СтрДеревоВид = Строка.Строки.Добавить();
				СтрДеревоВид.Номенклатура = Строка.Номенклатура;
				СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
				СтрДеревоВид.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
				СтрДеревоВид.ВидЦены = ВидЦен;
				
				//теперь добавим по всем единицам измерений по данной номенклатуре
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕдиницыИзмерений.Ссылка
				|ИЗ
				|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
				|ГДЕ
				|	ЕдиницыИзмерений.Владелец = &Владелец
				|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
				Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					СтрДеревоВид = Строка.Строки.Добавить();
					СтрДеревоВид.Номенклатура = Строка.Номенклатура;
					СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
					СтрДеревоВид.ЕдиницаИзмерения = Выборка.Ссылка;
					СтрДеревоВид.ВидЦены = ВидЦен;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЦикла;	
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВидЦенИзСтрок(ВидЦен)
	
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("стр");
	ТЗ.Колонки.Добавить("стрДерева");
	
	Для Каждого стрДерева Из Дерево.Строки Цикл 
		Для Каждого стр Из стрДерева.Строки Цикл 
			
			Если стр.ВидЦены = ВидЦен Тогда
				НовСтр = ТЗ.Добавить();
				НовСтр.стр = стр;
				НовСтр.СтрДерева = стрДерева;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого стр из ТЗ Цикл
		стр.стрДерева.Строки.Удалить(стр.стр);
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенУстанавливатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыЦен.ТекущиеДанные;
	
	Если КоличествоСтрокВДеревеЦен() > 0 Тогда
		Если ТекущиеДанные.Устанавливать Тогда
			Если Вопрос("Добавить вид цен " + ТекущиеДанные.ВидЦены + " в строки документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ДобавитьВидЦенВСтроки(ТекущиеДанные.ВидЦены);
			Иначе
				ТекущиеДанные.Устанавливать = Ложь;
			КонецЕсли;
		Иначе
			Если Вопрос("Удалить вид цен " + ТекущиеДанные.ВидЦены + " из строк документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				УдалитьВидЦенИзСтрок(ТекущиеДанные.ВидЦены);
			Иначе
				ТекущиеДанные.Устанавливать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАльтернативнуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовНоменклатуры()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.Материал);
	Список.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	Список.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	Список.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	Список.Добавить(Справочники.ВидыНоменклатуры.Услуга);
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура ОбработатьПодборНаСервере(ВозвращенноеЗначение)
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
		Если Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура",ТекущаяСтрока.Номенклатура)).Количество()=0 Тогда
			Стр = Дерево.Строки.Добавить();
			Стр.Номенклатура = ТекущаяСтрока.Номенклатура;
			
			ЗапросХарактеристики = Новый Запрос;
			ЗапросХарактеристики.Текст = 
			"ВЫБРАТЬ
			|	ХарактеристикиНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|ГДЕ
			|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
			ЗапросХарактеристики.УстановитьПараметр("Владелец", ТекущаяСтрока.Номенклатура);
			ТаблицаХарактеристики = ЗапросХарактеристики.Выполнить().Выгрузить();
			
			Для Каждого ТекущаяСтрокаВидЦен Из ВидыЦен Цикл
				Если ТаблицаХарактеристики.Количество() = 0 Тогда
					Если ТекущаяСтрокаВидЦен.Устанавливать Тогда
						СтрДеревоВид = Стр.Строки.Добавить();
						СтрДеревоВид.Номенклатура = Стр.Номенклатура;
						СтрДеревоВид.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
						СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
					КонецЕсли;
				Иначе
					Для Каждого Выборка Из ТаблицаХарактеристики Цикл
						Если ТекущаяСтрокаВидЦен.Устанавливать Тогда
							СтрДеревоВид = Стр.Строки.Добавить();
							СтрДеревоВид.Номенклатура = Стр.Номенклатура;
							СтрДеревоВид.ХарактеристикаНоменклатуры = Выборка.Ссылка;
							СтрДеревоВид.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
							СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
		
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатуры());
	//ПараметрыПодбора.Вставить("ВидЦены",				Объект.ВидЦены);
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",			Истина);
	ПараметрыПодбора.Вставить("НеЗапрашиватьКоличество",	Истина);
	
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		ОбработатьПодборНаСервере(ВозвращенноеЗначение);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКЦенам(Команда)
	
	СортироватьПоВидамЦен();
	
	Элементы.ГруппаВидыЦен.Видимость = Ложь;
	Элементы.ГруппаЦены.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоВидамЦен()
	
	//выгрузим во временную ТЗ виды цен в том порядке, которые заданы
	ВремТЗ_ВидыЦен = ВидыЦен.Выгрузить(,"ВидЦены");
	ВремТЗ_ВидыЦен.Колонки.Добавить("НомерСтроки",,"НомерСтроки");
	Сч = 0;
	Для Каждого ТекВидЦены Из ВремТЗ_ВидыЦен Цикл
		ТекВидЦены.НомерСтроки = Сч;
		Сч = Сч + 1;
	КонецЦикла;	
	
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
		
	//Проставим индексы по видам цен
	Для Каждого Стр из Дерево.Строки Цикл
		Если Стр.Строки.Количество() > 0 Тогда
			Для Каждого Ст из Стр.Строки Цикл
				СтруктураПоиска = новый Структура;
				СтруктураПоиска.Вставить("ВидЦены", Ст.ВидЦены);
				Индекс = ВремТЗ_ВидыЦен.НайтиСтроки(СтруктураПоиска);
				Если Индекс.Количество() = 0 Тогда
					Индекс = 0;
				Иначе
					Индекс = Индекс[0].НомерСтроки;
				КонецЕсли;  				
				
				Ст.ВидЦеныИндекс = Индекс;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	//отсортируем по проставленному индексу
	Для Каждого Стр из Дерево.Строки Цикл
		Если Стр.Строки.Количество() > 0 Тогда			
			Стр.Строки.Сортировать("ВидЦеныИндекс");
		КонецЕсли;
	КонецЦикла;	
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево); 	
		
КонецПроцедуры	

&НаКлиенте
Процедура ПерейтиКСпискуВидовЦен(Команда)
	
	Элементы.ГруппаВидыЦен.Видимость = Истина;
	Элементы.ГруппаЦены.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	Номенклатура = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора");
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ДобавитьНоменклатуруСервер(Номенклатура);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруСервер(Номенклатура)
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	
	ЗапросХарактеристики = Новый Запрос;
	ЗапросХарактеристики.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	ЗапросХарактеристики.УстановитьПараметр("Владелец", Номенклатура);
	РезультатЗапросаХарактеристики = ЗапросХарактеристики.Выполнить();
	
	Если Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура)).Количество()=0 Тогда		
		Стр = Дерево.Строки.Добавить();
		Стр.Номенклатура = Номенклатура;
		Для Каждого ТекущаяСтрокаВидЦен Из ВидыЦен Цикл
			Если ТекущаяСтрокаВидЦен.Устанавливать Тогда
				ВыборкаХарактеристики = РезультатЗапросаХарактеристики.Выбрать();
				Если ВыборкаХарактеристики.Количество() = 0 Тогда
					СтрДеревоВид = Стр.Строки.Добавить();
					СтрДеревоВид.Номенклатура = Стр.Номенклатура;
					СтрДеревоВид.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
					СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
					
					//теперь добавим по всем единицам измерений по данной номенклатуре
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕдиницыИзмерений.Ссылка
					|ИЗ
					|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
					|ГДЕ
					|	ЕдиницыИзмерений.Владелец = &Владелец
					|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
					Запрос.УстановитьПараметр("Владелец", Номенклатура);
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						СтрДеревоВид = Стр.Строки.Добавить();
						СтрДеревоВид.Номенклатура = Стр.Номенклатура;
						СтрДеревоВид.ЕдиницаИзмерения = Выборка.Ссылка;
						СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
					КонецЦикла;
				Иначе
					Пока ВыборкаХарактеристики.Следующий() Цикл
						СтрДеревоВид = Стр.Строки.Добавить();
						СтрДеревоВид.Номенклатура = Стр.Номенклатура;
						СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
						СтрДеревоВид.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
						СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
						
						//теперь добавим по всем единицам измерений по данной номенклатуре
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ЕдиницыИзмерений.Ссылка
						|ИЗ
						|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
						|ГДЕ
						|	ЕдиницыИзмерений.Владелец = &Владелец
						|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
						Запрос.УстановитьПараметр("Владелец", Номенклатура);
						Выборка = Запрос.Выполнить().Выбрать();
						Пока Выборка.Следующий() Цикл
							СтрДеревоВид = Стр.Строки.Добавить();
							СтрДеревоВид.Номенклатура = Стр.Номенклатура;
							СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
							СтрДеревоВид.ЕдиницаИзмерения = Выборка.Ссылка;
							СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВидЦен(Команда)
	Если Элементы.ЦеныНаФорме.ТекущиеДанные <> Неопределено И не Элементы.ЦеныНаФорме.ТекущиеДанные.Номенклатура.Пустая() Тогда
		ВидЦен = ОткрытьФормуМодально("Справочник.ВидыЦен.ФормаВыбора");
		Если ЗначениеЗаполнено(ВидЦен) Тогда
			ДобавитьВидЦенСервер(Элементы.ЦеныНаФорме.ТекущиеДанные.Номенклатура,ВидЦен);
		КонецЕсли	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВидЦенСервер(Номенклатура,ВидЦен)
	
	ЗапросХарактеристики = Новый Запрос;
	ЗапросХарактеристики.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	ЗапросХарактеристики.УстановитьПараметр("Владелец", Номенклатура);
	ТаблицаХарактеристики = ЗапросХарактеристики.Выполнить().Выгрузить();
	
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		Если Строка.Номенклатура = Номенклатура Тогда
			Если ТаблицаХарактеристики.Количество() = 0 Тогда
				Стр = Строка.Строки.Добавить();
				Стр.Номенклатура = Номенклатура;
				Стр.ВидЦены = ВидЦен;
				Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
			Иначе
				Для Каждого Выборка Из ТаблицаХарактеристики Цикл
					Стр = Строка.Строки.Добавить();
					Стр.Номенклатура = Номенклатура;
					Стр.ХарактеристикаНоменклатуры = Выборка.ССылка;
					Стр.ВидЦены = ВидЦен;
					Стр.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Стр.Номенклатура);
				КонецЦикла;
			КонецЕсли;
			ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
			Возврат;
		КонецЕсли
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаФормеНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ЦеныНаФорме.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаФормеЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ЦеныНаФорме.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаФормеПриИзменении(Элемент)
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	               |	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура";
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Сообщить ("Выбранная папка Номенклатуры пустая", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл		
		Номенклатура = Выборка.Номенклатура;
		ДобавитьНоменклатуруСервер(Номенклатура);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	ГруппаНоменклатуры = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбораГруппы");
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда 
		ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ЦеныНаФормеЦенаПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ЦеныНаФорме.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ЦеныНаФорме.ТекущиеДанные.Цена = "";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЦеныНаФормеЕдиницаИзмеренияПриИзменении(Элемент)
	//корневые строки редактировать нельзя
	Если Элементы.ЦеныНаФорме.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.ЦеныНаФорме.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиЦенамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦенаНоменклатуры.Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Дата,
	               |			Номенклатура = &Номенклатура
	               |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЦенаНоменклатуры
	               |ГДЕ
	               |	ЦенаНоменклатуры.Валюта = &Валюта
	               |	И ЦенаНоменклатуры.ВидЦены = &ВидЦены
	               |	И ЦенаНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения";
				   
	Дерево = ЦеныДерево.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Для Каждого Стр из ЭлементыСтроки Цикл
			Запрос.УстановитьПараметр("Дата", ТекущаяДата());
			Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Стр.ХарактеристикаНоменклатуры);
			Запрос.УстановитьПараметр("ВидЦены", Стр.ВидЦены);
			Запрос.УстановитьПараметр("ЕдиницаИзмерения", Стр.ЕдиницаИзмерения);
			Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
			РезультатЗапроса = Запрос.Выполнить();
			Если не РезультатЗапроса.Пустой() Тогда 
				Выгрузка = РезультатЗапроса.Выбрать();
				Пока Выгрузка.Следующий() Цикл
					Стр.Цена = Выгрузка.Цена;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиЦенами(Команда)
	Если ЦеныДерево.ПолучитьЭлементы().Количество()=0 Тогда 
		Сообщить("Таблица цен пуста, установка цен не выполнена");
	Иначе
		ЗаполнитьТекущимиЦенамиНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТоварамиИзДокументаНаСервере(ВозвращенноеЗначение)
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
		//нужно найти номенклатуру в деревере, чтобы добавить в ту же ветку
		//если не нашли сразу добавляем
		НайденнаяСтрока = Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
		Если НайденнаяСтрока.Количество()=0 Тогда
			Стр = Дерево.Строки.Добавить();			
			Стр.Номенклатура = ТекущаяСтрока.Номенклатура;
			Для Каждого ТекущаяСтрокаВидЦен Из ВидыЦен Цикл
				Если ТекущаяСтрокаВидЦен.Устанавливать Тогда
					СтрДеревоВид = Стр.Строки.Добавить();
					СтрДеревоВид.Номенклатура = Стр.Номенклатура;
					СтрДеревоВид.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					СтрДеревоВид.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения; //ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрДеревоВид.Номенклатура);
					СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
					СтрДеревоВид.Цена = ТекущаяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
		Иначе	
		//если нашли номенклатуру, нужно попробовать найти в паре с характеристикой		
			НайденнаяСтрокаСХарактеристикой = НайденнаяСтрока[0].Строки.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры",
													ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры));
			Если НайденнаяСтрокаСХарактеристикой.Количество() = 0 Тогда
				Для Каждого ТекущаяСтрокаВидЦен Из ВидыЦен Цикл					
					Если ТекущаяСтрокаВидЦен.Устанавливать Тогда
						СтрДеревоВид = НайденнаяСтрока[0].Строки.Добавить();
						СтрДеревоВид.Номенклатура = Стр.Номенклатура;
						СтрДеревоВид.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
						СтрДеревоВид.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
						СтрДеревоВид.ВидЦены = ТекущаяСтрокаВидЦен.ВидЦены;
						СтрДеревоВид.Цена = ТекущаяСтрока.Цена;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;		
		
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварамиИзДокумента(Команда)
	ВозвращенноеЗначение = ОткрытьФормуМодально("Документ.УстановкаЦенНоменклатуры.Форма.ФормаЗаполненияИзДокумента");
	Если ЗначениеЗаполнено(ВозвращенноеЗначение) Тогда
		ЗаполнитьТоварамиИзДокументаНаСервере(ВозвращенноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьЦеныНаСервере(ВидИсходныхДанных, Склад, ИсходныйВидЦен, КонечныйВидЦен, ПроцентНаценки)
	Дерево = ДанныеФормыВЗначение(ЦеныДерево, Тип("ДеревоЗначений"));
	Для Каждого Строка из Дерево.Строки Цикл
		
		ЗапросХарактеристики = Новый Запрос;
		ЗапросХарактеристики.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
		ЗапросХарактеристики.УстановитьПараметр("Владелец", Строка.Номенклатура);
		ТаблицаХарактеристик = ЗапросХарактеристики.Выполнить().Выгрузить();
		Если ТаблицаХарактеристик.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаХарактеристик.Добавить();
			НоваяСтрока.Ссылка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		
		Если ВидИсходныхДанных = 3 Тогда
			//наценка на указанный вид цен
			
			Для Каждого ТекХарактеристика Из ТаблицаХарактеристик Цикл
				ОтборИсходныеЦены = Новый Структура;
				ОтборИсходныеЦены.Вставить("ВидЦены", ИсходныйВидЦен);
				ОтборИсходныеЦены.Вставить("ХарактеристикаНоменклатуры", ТекХарактеристика.Ссылка);
				ТаблицаИсходных = Строка.Строки.НайтиСтроки(ОтборИсходныеЦены);
				
				ОтборКонечные = Новый Структура;
				ОтборКонечные.Вставить("ВидЦены", КонечныйВидЦен);
				ОтборКонечные.Вставить("ХарактеристикаНоменклатуры", ТекХарактеристика.Ссылка);
				ТаблицаКонечных = Строка.Строки.НайтиСтроки(ОтборКонечные);
				
				Если ТаблицаИсходных.Количество() > 0 И ТаблицаКонечных.Количество() > 0 Тогда
					ТаблицаКонечных[0].Цена = ТаблицаИсходных[0].Цена * (1 + ПроцентНаценки/100);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВидИсходныхДанных = 2 Тогда
			//наценка на цену последней покупки + доставка
			
			Для Каждого ТекХарактеристика Из ТаблицаХарактеристик Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫРАЗИТЬ(ВЫБОР
				|			КОГДА НЕ ЗакупкиОбороты.КоличествоОборот = 0
				|				ТОГДА ЗакупкиОбороты.СуммаОборот / ЗакупкиОбороты.КоличествоОборот
				|			ИНАЧЕ 0
				|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
				|ИЗ
				|	РегистрНакопления.Закупки.Обороты(
				|			,
				|			&ДатаЗапроса,
				|			Регистратор,
				|			Номенклатура = &Номенклатура
				|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЗакупкиОбороты
				|ГДЕ
				|	ЗакупкиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровИУслуг
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЗакупкиОбороты.Период Убыв";
				Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДата(),Объект.Дата));
				Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
				Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекХарактеристика.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					
					Для Каждого ТекЕдИзм Из Строка.Строки Цикл
						Если ТекЕдИзм.ХарактеристикаНоменклатуры = ТекХарактеристика.Ссылка и ТекЕдИзм.ВидЦены = КонечныйВидЦен Тогда
							Если ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100);
							ИначеЕсли ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100) * ТекЕдИзм.ЕдиницаИзмерения.Коэффициент;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Прервать;
					
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ВидИсходныхДанных = 1 Тогда
			//наценка на цену последней покупки без доставки (т.е. цена в поступлении)
			
			Для Каждого ТекХарактеристика Из ТаблицаХарактеристик Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПоступлениеТоваровИУслугТовары.Цена
				|ИЗ
				|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
				|ГДЕ
				|	ПоступлениеТоваровИУслугТовары.Номенклатура = &Номенклатура
				|	И ПоступлениеТоваровИУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
				|	И ПоступлениеТоваровИУслугТовары.Ссылка.Проведен
				|	И ПоступлениеТоваровИУслугТовары.Ссылка.Дата <= &ДатаЗапроса
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПоступлениеТоваровИУслугТовары.Ссылка.Дата Убыв";
				Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДата(),Объект.Дата));
				Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
				Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекХарактеристика.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					
					Для Каждого ТекЕдИзм Из Строка.Строки Цикл
						Если ТекЕдИзм.ХарактеристикаНоменклатуры = ТекХарактеристика.Ссылка и ТекЕдИзм.ВидЦены = КонечныйВидЦен Тогда
							Если ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100);
							ИначеЕсли ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100) * ТекЕдИзм.ЕдиницаИзмерения.Коэффициент;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Прервать;
					
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ВидИсходныхДанных = 0 Тогда
			//наценка на себестоимость
			
			Для Каждого ТекХарактеристика Из ТаблицаХарактеристик Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫРАЗИТЬ(ВЫБОР
				|			КОГДА НЕ ТоварыНаСкладахОстатки.КоличествоОстаток = 0
				|				ТОГДА ТоварыНаСкладахОстатки.СуммаОстаток / ТоварыНаСкладахОстатки.КоличествоОстаток
				|			ИНАЧЕ 0
				|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(
				|			&ДатаЗапроса,
				|			Номенклатура = &Номенклатура
				|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
				|				И ВЫБОР
				|					КОГДА НЕ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|						ТОГДА Склад = &Склад
				|					ИНАЧЕ 1 = 1
				|				КОНЕЦ) КАК ТоварыНаСкладахОстатки";
				Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДата(),Объект.Дата));
				Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
				Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекХарактеристика.Ссылка);
				Запрос.УстановитьПараметр("Склад",Склад);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					
					Для Каждого ТекЕдИзм Из Строка.Строки Цикл
						Если ТекЕдИзм.ХарактеристикаНоменклатуры = ТекХарактеристика.Ссылка и ТекЕдИзм.ВидЦены = КонечныйВидЦен Тогда
							Если ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100);
							ИначеЕсли ТипЗнч(ТекЕдИзм.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
								ТекЕдИзм.Цена = Выборка.Цена * (1 + ПроцентНаценки/100) * ТекЕдИзм.ЕдиницаИзмерения.Коэффициент;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Прервать;
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
	ЗначениеВДанныеФормы(Дерево, ЦеныДерево);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	Если ЦеныДерево.ПолучитьЭлементы().Количество()=0 Тогда 
		Сообщить("Таблица цен пуста, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	
	сз_ВидыЦен = Новый СписокЗначений;
	Для каждого Строка Из ВидыЦен Цикл
		Если Строка.Устанавливать тогда
			сз_видыЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	сз_ВидыЦен);
	
	ВозвращенноеЗначение = ОткрытьФормуМодально("Документ.УстановкаЦенНоменклатуры.Форма.ФормаРасчетаЦен", ПараметрыФормы);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		Если НЕ ВозвращенноеЗначение.КонечныйВидЦен = Неопределено
			И НЕ ВозвращенноеЗначение.ПроцентНаценки = Неопределено Тогда
			
			Если Вопрос("Вид цены """ + Строка(ВозвращенноеЗначение.КонечныйВидЦен) + """ будет перерассчитан. Продолжить?", 
				РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				РассчитатьЦеныНаСервере(ВозвращенноеЗначение.ВидИсходныхДанных, ВозвращенноеЗначение.СкладОстатков, ВозвращенноеЗначение.ИсходныйВидЦен, ВозвращенноеЗначение.КонечныйВидЦен, ВозвращенноеЗначение.ПроцентНаценки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦену(Команда)
	Если ЦеныДерево.ПолучитьЭлементы().Количество()=0 Тогда 
		Сообщить("Таблица цен пуста, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветУстановитьОбщуюЦену", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Установить общую цену для всех позиций номенклатуры?", РежимДиалогаВопрос.ДаНет);		
КонецПроцедуры

&НаКлиенте
Процедура ОтветУстановитьОбщуюЦену(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьЦенуПослеВыбора",ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещенияВыборЦены,0,"Введите цену");
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуПослеВыбора(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	Дерево = ЦеныДерево.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Для Каждого Стр из ЭлементыСтроки Цикл
			Стр.Цена = ВыбЗнач;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенамиПоставщика(Команда)
	
	СписокВидаЦен = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из ВидыЦен Цикл
		Если ТекущаяСтрока.Устанавливать Тогда
			СписокВидаЦен.Добавить(ТекущаяСтрока.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыЦен", СписокВидаЦен);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораЦенПоставщика", ЭтаФорма);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаВыборЦенПоставщика", ПараметрыФормы, ЭтаФорма, ,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЦенПоставщика(Парам1, Парам2) Экспорт
	Если НЕ Парам1 = Неопределено Тогда
		ЗаполнитьПоЦенамПоставщика(Парам1.ВидЦен, Парам1.Контрагент);
		ПоказатьПредупреждение(,"Цены изменены");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЦенамПоставщика(ВидЦен, Контрагент)
	ВремЦеныДерево = РеквизитФормыВЗначение("ЦеныДерево");
	Для Каждого ТекущаяНоменклатура Из ВремЦеныДерево.Строки Цикл
		Для Каждого ТекущаяСтрока Из ТекущаяНоменклатура.Строки Цикл
			Если ТекущаяСтрока.ВидЦены = ВидЦен Тогда
				ТекущаяСтрока.Цена = РегистрыСведений.ЦеныПоставщиков.ПолучитьЦенуНоменклатурыВВалюте(ТекущаяДата(), Контрагент, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ЕдиницаИзмерения, Объект.Валюта);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ВремЦеныДерево,"ЦеныДерево");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаСумму(Команда)
	ПослеВводаСуммыДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаСуммыДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаСуммыДляИзмененияВсехСтрок,0,"Введите сумму",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммыДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если НЕ Число = Неопределено Тогда
		
		Дерево = ЦеныДерево.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из Дерево Цикл
			ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
			Для Каждого Стр из ЭлементыСтроки Цикл
				Стр.Цена = Стр.Цена + Число;
			КонецЦикла;
		КонецЦикла;
		
		ПоказатьПредупреждение(,"Цены изменены");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаПроцент(Команда)
	ПослеВводаПроцентаДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаПроцентаДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаПроцентаДляИзмененияВсехСтрок,0,"Введите %",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПроцентаДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если НЕ Число = Неопределено Тогда
		
		Дерево = ЦеныДерево.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из Дерево Цикл
			ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
			Для Каждого Стр из ЭлементыСтроки Цикл
				Стр.Цена = Стр.Цена + Стр.Цена*(Число/100);
			КонецЦикла;
		КонецЦикла;
		
		ПоказатьПредупреждение(,"Цены изменены");
    КонецЕсли;
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовВидыЦен

&НаКлиенте
Процедура ВидыЦенУстановитьВсе(Команда)
	
	Если Вопрос("Добавить все виды цен в строки документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Для каждого СтрокаВидЦены из ВидыЦен Цикл
			Если НЕ СтрокаВидЦены.Устанавливать Тогда
				СтрокаВидЦены.Устанавливать = Истина;
				ДобавитьВидЦенВСтроки(СтрокаВидЦены.ВидЦены);
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенСнятьВсе(Команда)
	
	Если Вопрос("Удалить все виды цен из строк документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Для каждого СтрокаВидЦены из ВидыЦен Цикл
			Если СтрокаВидЦены.Устанавливать Тогда
				СтрокаВидЦены.Устанавливать = Ложь;
				УдалитьВидЦенИзСтрок(СтрокаВидЦены.ВидЦены);
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовЦены

&НаКлиенте
Процедура РазвернутьДеревоДокумента(Команда)
	
	КоллекцияЭлементовДерева=ЦеныДерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();     
		Элементы.ЦеныНаФорме.Развернуть(ИдентификаторСтроки);      
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоЦенДокумента(Команда)
	
	КоллекцияЭлементовДерева=ЦеныДерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();      
		Элементы.ЦеныНаФорме.Свернуть(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
